// Keyboard HID (handsfree) panel
"MSG_TYPE_PASSKEY" = "キーボードから次のパスコードを入力して、Return キーを押してください。";

"MSG_PAIRING_TIMEOUT" = "“%@”を登録できません。“登録”をクリックして、もう一度やり直してください。";
"MSG_PAIRING_TIMEOUT_AUTO" = "“%@”を登録できません。5 秒待ってから次のキーボードを試してください。";
"MSG_PAIRING_TIMEOUT_AUTO_LAST" = "“%@”を登録できません。5 秒待ってからもう一度やり直してください。";

"MSG_PAIRING_FAILED" = "お使いのキーボードを登録できません。“登録”をクリックして、もう一度やり直してください。";
"MSG_PAIRING_FAILED_AUTO" = "お使いのキーボードを登録できません。再試行しています...";

// Discovery Panel (General)
"kDiscovery_Gen_ErrorOccurredSearchingKey" = "ワイヤレスデバイスの検索中に問題が起きました。";


//getPairingWithDeviceTitle;
"TITLE_PAIRING_WITH_YOUR_KEYBOARD" = "キーボード“%@”を登録しています。";
"TITLE_PAIRING_WITH_YOUR_MOUSE" = "マウス“%@”を登録しています。";

//getSearchingForDeviceTitle;
"TITLE_SEARCHING_FOR_YOUR_KEYBOARD" = "キーボードを検出中...";
"TITLE_SEARCHING_FOR_YOUR_MOUSE" = "マウスを検出中...";

//getDevicePairedTitle
"TITLE_PAIRED_KEYBOARD" = "“%@”はコンピュータに問題なく登録されました。";
"TITLE_PAIRED_MOUSE" = "“%@”はコンピュータに問題なく登録されました";

//getNFoundTitle
"TITLE_KEYBOARD_N_FOUND" = "設定アシスタントは %d 個のワイヤレスキーボードを見つけました。";
"TITLE_MOUSE_N_FOUND" = "設定アシスタントは %d 個のワイヤレスマウスを見つけました。";

//getFoundTitle
"TITLE_KEYBOARD_FOUND" = "“%@”という名前のキーボードを検出しました。";
"TITLE_MOUSE_FOUND" = "“%@”という名前のマウスを検出しました。";

//getMessageStartPairing
"MSG_START_PAIRING_KEYBOARD" = "お使いのキーボードをリストから選択して、“登録”をクリックしてください。キーボードが登録されたら、パスコードが表示されますので、キーボードから入力してください。";
"MSG_START_PAIRING_MOUSE" = "リストにある各マウスを登録中です。マウスが登録されたら、マウスを使ってポインタを動かすことができます。";

//getMessageStartPairingSingle
"MSG_START_PAIRING_KEYBOARD_SINGLE" = "“%@”の登録は自動的に開始します。キーボードが登録されたら、パスコードが表示されますので、キーボードから入力してください。";
"MSG_START_PAIRING_MOUSE_SINGLE" = "“%@”の登録は自動的に開始します。マウスが登録されたら、マウスを使ってポインタを動かすことができます。";

//getMessageDeviceNotFound
"MSG_KEYBOARDS_NOT_FOUND_SO_FAR" = "キーボードが見つかりません。検索中...";
"MSG_MOUSE_NOT_FOUND_SO_FAR" = "マウスが見つかりません。検索中...";

//getMessageNoDevice
"MSG_NO_KEYBOARD" = "キーボードが接続されていません。キーボードを接続してください。";
"MSG_NO_MOUSE" = "マウスが接続されていません。マウスを接続してください。";

//getMessageNoDeviceBT
"MSG_NO_KEYBOARD_BLUETOOTH"	= "キーボードが接続されていません。キーボードを接続してください。\n\nApple Wireless Keyboard をお使いの場合、電池が正しくセットされており、電源が入っていることを確認してください。";
"MSG_NO_MOUSE_BLUETOOTH" = "マウスが接続されていません。マウスを接続してください。\n\nApple Wireless Mouse をお使いの場合、マウスの底面のスイッチを探し、カバーをスライドさせて LED が見えるようにして、電源を入れてください。\n\nマウスを使用しない場合は、キーボードを接続してください。";

//getMessageGettingDeviceName
"MSG_GETTING_KEYBOARD_NAMES" = "%d キーボードの名前を更新中...";
"MSG_GETTING_MOUSE_NAMES" = "%d マウスの名前を更新中...";

//getMessageWaitingForAcknowlegement
"MSG_WAITING_FOR_KEYBOARD_ACKNOWLEGEMENT" = "登録を確認するには、キーボードの Return キーを押してください。キーが押されない場合、%d 秒後にもう一度登録操作が始まります。";
"MSG_WAITING_FOR_MOUSE_ACKNOWLEGEMENT" = "登録を確認するには、マウスを使って下に表示されている“OK”ボタンをクリックしてください。クリックされない場合、%d 秒後にもう一度登録操作が始まります。";

//getMessageAuthenticationFailure
"MSG_AUTH_FAILURE_KEYBOARD" = "入力したパスコードが正しくありません。“登録”をクリックして、もう一度やり直してください。";
"MSG_AUTH_FAILURE_MOUSE" = "マウスの登録に失敗しました。“登録”をクリックして、もう一度やり直してください。";

//getMessageAuthenticationFailureAuto
"MSG_AUTH_FAILURE_KEYBOARD_AUTO" = "入力したパスコードが正しくありません。5 秒待ってから、もう一度キーボードの登録をしてください。";
"MSG_AUTH_FAILURE_MOUSE_AUTO" = "マウスの登録に失敗しました。5 秒待ってから、もう一度マウスの登録をしてください。";

//getMessageAlreadyPaired
"MSG_ALREADY_PAIRED_KEYBOARD" = "キーボードが接続するのを待っています...";
"MSG_ALREADY_PAIRED_MOUSE" = "マウスを使い始めるには、目的のマウスをクリックします。";

// ** WARNINGS **
//getWarningPairingSingle
"MSG_WARNING_PAIRING_MOUSE_SINGLE" = "お使いのマウスではない場合、マウスの電源が入っていることを確認してから、もう一度検出が始まるまで待ってください。";
"MSG_WARNING_PAIRING_KEYBOARD_SINGLE" = "お使いのキーボードではない場合、キーボードの電源が入っていることを確認してから、もう一度検出が始まるまで待ってください。";

//getWarningPairing 
"MSG_WARNING_PAIRING_MOUSE" = "お使いのマウスがリストにない場合、マウスの電源が入っていることを確認してから、もう一度検出が始まるまで待ってください。";
"MSG_WARNING_PAIRING_KEYBOARD" = "お使いのキーボードがリストにない場合、キーボードの電源が入っていることを確認してから、“キャンセル”をクリックして、もう一度検出を行ってください。";

//getWarningAcknowlegement
"MSG_WARNING_ACK_MOUSE" = "マウスを動かしてもポインタが動かない場合、お使いのマウスはコンピュータに登録されていません。もう一度登録操作が始まるまで待ってください。";
"MSG_WARNING_ACK_KEYBOARD" = "キーボードの Return キーを押しても登録が確認されない場合、お使いのキーボードはコンピュータに登録されていません。もう一度登録操作が始まるまで待ってください。";

// ** PAIRING STATUS **
//getMessagePairingStarting
"MSG_PAIRING_STARTING" = "デバイスを登録中...";

//getMessagePairingConnectingToDevice
"MSG_PAIRING_CONNECTING" = "接続中...";

//getMessagePairingConnectionEstablished
"MSG_PAIRING_CONNECTION_ESTABLISHED" = "接続されました。";

//getMessagePairingConnectionComplete
"MSG_PAIRING_COMPLETE" = "登録が完了しました。";

"CUSTOM_MOUSE_NAME"	= "%@のマウス";
"CUSTOM_KEYBOARD_NAME"	= "%@のキーボード";

